Конфигурация/DataProcessors/ЗагрузкаЗакупочныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаЗакупочныхЦен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>шт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>кг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>л</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>м</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Переоценка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Переоценка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ИнвентаризацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИнвентаризацияТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетноеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНедостачиИзлишков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Comment>Физическое лицо предприниматель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/DataProcessors/ЗагрузкаЗакупочныхЦен/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Загружает данные из Excel-файла и возвращает таблицу значений для предпросмотра.
//
// Параметры:
//  АдресХранилища - Строка - адрес файла во временном хранилище.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с данными из файла.
//
Функция ЗагрузитьДанныеИзФайла(АдресХранилища) Экспорт
	
	ТабличныйДокумент = ПрочитатьExcelИзХранилища(АдресХранилища);
	
	ТаблицаДанных = СоздатьТаблицуДанных();
	
	ЗаполнитьТаблицуИзДокумента(ТабличныйДокумент, ТаблицаДанных);
	
	Если ТаблицаДанных.Количество() > 0 Тогда
		НайтиНоменклатуруПоШтрихкодам(ТаблицаДанных);
		ЗаполнитьСтарыеЦены(ТаблицаДанных);
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции

// Создает документ Переоценка с загруженными закупочными ценами.
//
// Параметры:
//  ТаблицаДанных - ТаблицаЗначений - данные из ЗагрузитьДанныеИзФайла().
//
// Возвращаемое значение:
//  Структура - результат загрузки:
//    * Успешно - Булево
//    * Количество - Число
//    * НомерДокумента - Строка
//    * СообщениеОбОшибке - Строка
//
Функция ЗагрузитьЦены(ТаблицаДанных) Экспорт
	
	Результат = Новый Структура("Успешно, Количество, НомерДокумента, СообщениеОбОшибке", Ложь, 0, "", "");
	
	ТипЦенЗакупочная = ПолучитьТипЦенЗакупочная();
	Если ТипЦенЗакупочная.Пустая() Тогда
		Результат.СообщениеОбОшибке = "Не найден тип цен 'Закупочная'";
		Возврат Результат;
	КонецЕсли;
	
	СоответствиеНоменклатуры = ПодготовитьДанныеДляЗагрузки(ТаблицаДанных);
	
	Если СоответствиеНоменклатуры.Количество() = 0 Тогда
		Результат.СообщениеОбОшибке = "Нет данных для загрузки";
		Возврат Результат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ДокументОбъект = Документы.Переоценка.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.ТипЦен = ТипЦенЗакупочная;
		
		Для Каждого КлючЗначение Из СоответствиеНоменклатуры Цикл
			Данные = КлючЗначение.Значение;
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = Данные.Номенклатура;
			НоваяСтрока.Цена = Данные.ЦенаЗакупки;
			НоваяСтрока.Штрихкод = Данные.Штрихкод;
			НоваяСтрока.СтараяЦена = Данные.СтараяЦена;
		КонецЦикла;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Результат.Успешно = Истина;
		Результат.Количество = СоответствиеНоменклатуры.Количество();
		Результат.НомерДокумента = ДокументОбъект.Номер;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.СообщениеОбОшибке = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьНоменклатуру(ТаблицаДанных) Экспорт
	
	Результат = Новый Структура("Успешно, Количество, СообщениеОбОшибке", Истина, 0, "");
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		Если СтрокаДанных.Статус <> "Не найден" Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			
			НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			НовыйЭлемент.Наименование = СтрокаДанных.НаименованиеФайл;
			НовыйЭлемент.Артикул = СтрокаДанных.Артикул;
			НовыйЭлемент.КодУКТЗЕД = СтрокаДанных.КодУКТЗЕД;
			НовыйЭлемент.ЕдиницаИзмерения = МаппингЕдиницыИзмерения(СтрокаДанных.ЕдиницаИзмерения);
			НовыйЭлемент.Записать();
			
			Если НЕ ПустаяСтрока(СтрокаДанных.Штрихкод) Тогда
				НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Штрихкод.Установить(СтрокаДанных.Штрихкод);
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Штрихкод = СтрокаДанных.Штрихкод;
				НоваяЗапись.Номенклатура = НовыйЭлемент.Ссылка;
				НаборЗаписей.Записать(Истина);
			КонецЕсли;
			
			СтрокаДанных.Номенклатура = НовыйЭлемент.Ссылка;
			СтрокаДанных.НоменклатураНаименование = НовыйЭлемент.Наименование;
			СтрокаДанных.Статус = "Создан";
			Результат.Количество = Результат.Количество + 1;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Результат.Успешно = Ложь;
			Результат.СообщениеОбОшибке = Результат.СообщениеОбОшибке
				+ СтрокаДанных.НаименованиеФайл + ": " + ОписаниеОшибки() + Символы.ПС;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьЦеныРозница(ТаблицаДанных) Экспорт
	
	Результат = Новый Структура("Успешно, Количество, НомерДокумента, СообщениеОбОшибке", Ложь, 0, "", "");
	
	ТипЦенРозничная = ПолучитьТипЦен("Розничная");
	Если ТипЦенРозничная.Пустая() Тогда
		Результат.СообщениеОбОшибке = "Не найден тип цен 'Розничная'";
		Возврат Результат;
	КонецЕсли;
	
	СоответствиеНоменклатуры = Новый Соответствие;
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если (СтрокаДанных.Статус = "Найден" ИЛИ СтрокаДанных.Статус = "Создан")
			И СтрокаДанных.ЦенаРозница > 0 Тогда
			СоответствиеНоменклатуры.Вставить(СтрокаДанных.Номенклатура, СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	
	Если СоответствиеНоменклатуры.Количество() = 0 Тогда
		Результат.СообщениеОбОшибке = "Нет данных для загрузки розничных цен";
		Возврат Результат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ДокументОбъект = Документы.Переоценка.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.ТипЦен = ТипЦенРозничная;
		
		Для Каждого КлючЗначение Из СоответствиеНоменклатуры Цикл
			Данные = КлючЗначение.Значение;
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = Данные.Номенклатура;
			НоваяСтрока.Цена = Данные.ЦенаРозница;
			НоваяСтрока.Штрихкод = Данные.Штрихкод;
		КонецЦикла;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Результат.Успешно = Истина;
		Результат.Количество = СоответствиеНоменклатуры.Количество();
		Результат.НомерДокумента = ДокументОбъект.Номер;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.СообщениеОбОшибке = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьОстатки(ТаблицаДанных) Экспорт
	
	Результат = Новый Структура("Успешно, Количество, НомерДокумента, СообщениеОбОшибке", Ложь, 0, "", "");
	
	МассивДанных = Новый Массив;
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если (СтрокаДанных.Статус <> "Найден" И СтрокаДанных.Статус <> "Создан")
			ИЛИ СтрокаДанных.Остаток <= 0 Тогда
			Продолжить;
		КонецЕсли;
		МассивДанных.Добавить(СтрокаДанных);
	КонецЦикла;
	
	Если МассивДанных.Количество() = 0 Тогда
		Результат.СообщениеОбОшибке = "Нет данных для загрузки остатков";
		Возврат Результат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ДокументОбъект = Документы.ИнвентаризацияТоваров.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Склад = Справочники.Склады.ОсновнойСклад;
		
		Для Каждого СтрокаДанных Из МассивДанных Цикл
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = СтрокаДанных.Номенклатура;
			НоваяСтрока.ФактическоеКоличество = СтрокаДанных.Остаток;
			НоваяСтрока.УчетноеКоличество = 0;
			НоваяСтрока.Штрихкод = СтрокаДанных.Штрихкод;
			Если СтрокаДанных.ЦенаЗакупки > 0 Тогда
				НоваяСтрока.Цена = СтрокаДанных.ЦенаЗакупки;
			КонецЕсли;
		КонецЦикла;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		Результат.Успешно = Истина;
		Результат.Количество = МассивДанных.Количество();
		Результат.НомерДокумента = ДокументОбъект.Номер;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.СообщениеОбОшибке = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьExcelИзХранилища(АдресХранилища)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	УдалитьИзВременногоХранилища(АдресХранилища);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла); // BSLLS:FileSystemAccess-off
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СоздатьТаблицуДанных()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТаблицаДанных.Колонки.Добавить("НаименованиеФайл", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ТаблицаДанных.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанных.Колонки.Добавить("НоменклатураНаименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ТаблицаДанных.Колонки.Добавить("ЦенаЗакупки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаДанных.Колонки.Добавить("СтараяЦена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаДанных.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(30)));
	ТаблицаДанных.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(25)));
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
	ТаблицаДанных.Колонки.Добавить("ЦенаРозница", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаДанных.Колонки.Добавить("Остаток", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаДанных.Колонки.Добавить("КодУКТЗЕД", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ЗаполнитьТаблицуИзДокумента(ТабличныйДокумент, ТаблицаДанных)
	
	ОписаниеЧислаЦена = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	ОписаниеЧислаОстаток = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3));
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
		
		НаименованиеЗначение = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 2).Текст);
		Если ПустаяСтрока(НаименованиеЗначение) Тогда
			Продолжить;
		КонецЕсли;
		
		ШтрихкодЗначение = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 6).Текст);
		АртикулЗначение = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 1).Текст);
		ЕИЗначение = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 3).Текст);
		КодУКТЗЕДЗначение = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 8).Текст);
		
		ЦенаРозницаТекст = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 4).Текст), ",", ".");
		ОстатокТекст = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 5).Текст), ",", ".");
		ЦенаЗакупкиТекст = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область(НомерСтроки, 9).Текст), ",", ".");
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Штрихкод = ШтрихкодЗначение;
		НоваяСтрока.НаименованиеФайл = НаименованиеЗначение;
		НоваяСтрока.Артикул = АртикулЗначение;
		НоваяСтрока.ЕдиницаИзмерения = ЕИЗначение;
		НоваяСтрока.КодУКТЗЕД = КодУКТЗЕДЗначение;
		НоваяСтрока.ЦенаЗакупки = ОписаниеЧислаЦена.ПривестиЗначение(ЦенаЗакупкиТекст);
		НоваяСтрока.ЦенаРозница = ОписаниеЧислаЦена.ПривестиЗначение(ЦенаРозницаТекст);
		НоваяСтрока.Остаток = ОписаниеЧислаОстаток.ПривестиЗначение(ОстатокТекст);
		НоваяСтрока.Статус = "Не найден";
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиНоменклатуруПоШтрихкодам(ТаблицаДанных)
	
	МассивШтрихкодов = ТаблицаДанных.ВыгрузитьКолонку("Штрихкод");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтрихкодыРег.Штрихкод КАК Штрихкод,
		|	ШтрихкодыРег.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(СправочникНоменклатура.Наименование, """") КАК НоменклатураНаименование
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК ШтрихкодыРег
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ШтрихкодыРег.Номенклатура = СправочникНоменклатура.Ссылка
		|ГДЕ
		|	ШтрихкодыРег.Штрихкод В (&МассивШтрихкодов)";
	
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	
	СоответствиеШтрихкодов = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеШтрихкодов.Вставить(Выборка.Штрихкод,
			Новый Структура("Номенклатура, Наименование", Выборка.Номенклатура, Выборка.НоменклатураНаименование));
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		ДанныеШтрихкода = СоответствиеШтрихкодов.Получить(СтрокаДанных.Штрихкод);
		Если ДанныеШтрихкода = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДанных.Номенклатура = ДанныеШтрихкода.Номенклатура;
		СтрокаДанных.НоменклатураНаименование = ДанныеШтрихкода.Наименование;
		СтрокаДанных.Статус = "Найден";
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтарыеЦены(ТаблицаДанных)
	
	МассивНоменклатуры = Новый Массив;
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если СтрокаДанных.Статус <> "Найден" Тогда
			Продолжить;
		КонецЕсли;
		Если МассивНоменклатуры.Найти(СтрокаДанных.Номенклатура) = Неопределено Тогда
			МассивНоменклатуры.Добавить(СтрокаДанных.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипЦенЗакупочная = ПолучитьТипЦенЗакупочная();
	
	ЗапросЦен = Новый Запрос;
	ЗапросЦен.Текст =
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|		,
		|		ТипЦен = &ТипЦен
		|			И Номенклатура В (&МассивНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних";
	
	ЗапросЦен.УстановитьПараметр("ТипЦен", ТипЦенЗакупочная);
	ЗапросЦен.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	СоответствиеЦен = Новый Соответствие;
	ВыборкаЦен = ЗапросЦен.Выполнить().Выбрать();
	Пока ВыборкаЦен.Следующий() Цикл
		СоответствиеЦен.Вставить(ВыборкаЦен.Номенклатура, ВыборкаЦен.Цена);
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если СтрокаДанных.Статус <> "Найден" Тогда
			Продолжить;
		КонецЕсли;
		СтараяЦена = СоответствиеЦен.Получить(СтрокаДанных.Номенклатура);
		Если СтараяЦена <> Неопределено Тогда
			СтрокаДанных.СтараяЦена = СтараяЦена;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТипЦен(Знач Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТипыЦен.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТипыЦен КАК ТипыЦен
		|ГДЕ
		|	ТипыЦен.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ТипыЦен.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьТипЦенЗакупочная()
	
	Возврат ПолучитьТипЦен("Закупочная");
	
КонецФункции

Функция ПодготовитьДанныеДляЗагрузки(ТаблицаДанных)
	
	СоответствиеНоменклатуры = Новый Соответствие;
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если (СтрокаДанных.Статус = "Найден" ИЛИ СтрокаДанных.Статус = "Создан")
			И СтрокаДанных.ЦенаЗакупки > 0 Тогда
			СоответствиеНоменклатуры.Вставить(СтрокаДанных.Номенклатура, СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СоответствиеНоменклатуры;
	
КонецФункции

Функция МаппингЕдиницыИзмерения(Знач ТекстЕИ)
	
	ТекстЕИ = СокрЛП(ТекстЕИ);
	
	Если НРег(ТекстЕИ) = "шт" Тогда
		Возврат Перечисления.ЕдиницыИзмерения.шт;
	ИначеЕсли НРег(ТекстЕИ) = "кг" Тогда
		Возврат Перечисления.ЕдиницыИзмерения.кг;
	ИначеЕсли НРег(ТекстЕИ) = "л" Тогда
		Возврат Перечисления.ЕдиницыИзмерения.л;
	ИначеЕсли НРег(ТекстЕИ) = "м" Тогда
		Возврат Перечисления.ЕдиницыИзмерения.м;
	Иначе
		Возврат Перечисления.ЕдиницыИзмерения.шт;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
